/**
 * 所有请求的域名与端口号
 */
let baseUrl = 'http://192.168.1.100:8000';

/**
 *  a 用户登录模块
 */
    /**
     *  1.获取验证码
     *      接口名称: /user/getCode,
     *      请求方式: get,
     *      传入参数: 无,
     *      
     *      响应报文:{
     *          data: {
     *              code:‘12345’    
     *          },
                msg: '成功',
                statusCode: 200, 
     *      }
     */

     
    /**
     *  2.登陆
     *      接口名称: /user/login,
     *      请求方式: post,
     *      传入参数: {
     *          phone:'', //"18755441234","18355664734","123456789";其中之一
     *      },
     *      
     *      响应报文:{
     *          data: {},
                msg: '成功', // 失败的信息是: 登录失败,手机号错误
                statusCode: 200, // 失败: 999
     *      }
     */


/**
    * b. 获取今日赛事信息以及球队球员排名
*/
    /**
     *  1.获取今日进行的比赛的信息
     *      接口名称: /gamesData/todayGames,
     *      请求方式: get,
     *      传入参数: 无
     *      
     *      响应报文:{
     *          data: {
     *              games:[
     *                  {
        *                   "host":{
                                "name":"勇士",
                                "score":"112"
                            },
                            "guest":{
                                "name":"火箭",
                                "score":"110"
                            },
                            "status":0,
                            "like":10
     *                  },
                        ...
     *              ]
     *          },
                msg: '成功', 
                statusCode: 200,
     *      }
     */


    /**
     *  2.球队排行榜
     *      接口名称: /gamesData/teamRank,
     *      请求方式: get,
     *      传入参数: 无
     *      
     *      响应报文:{
     *          data: {
     *              teamRank:[
     *                  {
                            "rank":1,
                            "name":"雄鹿",
                            "winLose":"60-22",
                            "winRate":"73.2%",
                            "current":"1连败"
                        },
                        ...
     *              ]
     *          },
                msg: '成功', 
                statusCode: 200,
     *      }
     */


    /**
     *  3.得分排行榜
     *      接口名称: /gamesData/scoreRank,
     *      请求方式: get,
     *      传入参数: 无
     *      
     *      响应报文:{
     *          data: {
     *              scoreRank:[
     *                  {
                            "rank":1,
                            "name":"雄鹿",
                            "score":"118.1"
                        },
                        ...
     *              ]
     *          },
                msg: '成功', 
                statusCode: 200,
     *      }
     */



    /**
     *  4.球员排行榜
     *      接口名称: /gamesData/playerRank,
     *      请求方式: get,
     *      传入参数: 无
     *      
     *      响应报文:{
     *          data: {
     *              playerRank:[
     *                  {
                            "rank":1,
                            "name":"哈登",
                            "team":"火箭",
                            "score":"36.1",
                            "rebound":"6.6",
                            "assist":"7.5"
                        },
                        ...
     *              ]
     *          },
                msg: '成功', 
                statusCode: 200,
     *      }
     */


/**
 * c. nba比赛相关的新闻
 */

    /**
     *  1.今天比赛的新闻
     *      接口名称: /news/todayGamesNews,
     *      请求方式: get,
     *      传入参数: 无
     *      
     *      响应报文:{
     *          data: {
     *              todayGamesNews:[
     *                  {
                            "id":"TGN_20190413_001",
                            "title":"官方：湖人与主帅卢克沃顿分道扬镳",
                            "commentsNum":1758,
                            "nice":14,
                            "isTop":true,
                            "time":"5小时前",
                            "source":"NBA官网",
                            "sourceLink":"https:www.baidu.com",
                            "content":"虎扑4月13日讯 今日湖人官方宣布，球队与主帅卢克-沃顿分道扬镳。沃顿说道：“我想要感谢珍妮-巴斯和巴斯家族给予我执教湖人的机会。这支球队和这座城市对于我和我家人而言总是很特别。”总经理罗勃-佩林卡说道：“我们想感谢卢克在过去三年来的热忱付出，我们祝福卢克和他的家人未来好运。”沃顿共在湖人执教三个赛季，取得98胜148负的战绩。本赛季湖人以37胜45负的战绩排名西部第十。",
                            "tags":["湖人","卢克-沃顿"]
                        },
                        ...
     *              ]
     *          },
                msg: '成功', 
                statusCode: 200,
     *      }
     */


    /**
     *  2.比赛有关的其他新闻
     *      接口名称: /news/otherNews,
     *      请求方式: get,
     *      传入参数: 无
     *      
     *      响应报文:{
     *          data: {
     *              otherNews:[
     *                  {
                            "id":"OTN_20190413_001",
                            "title":"戈登：哈登值得一个MVP",
                            "commentsNum":1758,
                            "nice":14,
                            "isTop":true,
                            "time":"5小时前",
                            "source":"NBA官网",
                            "sourceLink":"https:www.baidu.com",
                            "content":"虎扑4月13日讯 今日湖人官方宣布，球队与主帅卢克-沃顿分道扬镳。沃顿说道：“我想要感谢珍妮-巴斯和巴斯家族给予我执教湖人的机会。这支球队和这座城市对于我和我家人而言总是很特别。”总经理罗勃-佩林卡说道：“我们想感谢卢克在过去三年来的热忱付出，我们祝福卢克和他的家人未来好运。”沃顿共在湖人执教三个赛季，取得98胜148负的战绩。本赛季湖人以37胜45负的战绩排名西部第十。",
                            "tags":["火箭","戈登"]
                        },
                        ...
     *              ]
     *          },
                msg: '成功', 
                statusCode: 200,
     *      }
     */



    /**
     *  2.获取赛事新闻的评论信息
     *      接口名称: /news/getComments,
     *      请求方式: post,
     *      传入参数: {
     *          id:'', // ‘TGN_20190413_001’: 新闻的id
     *      }
     *      
     *      响应报文:{
     *          data: {
     *              comment:{
                            "id":"OTN_20190413_001",
                            "title":"戈登：哈登值得一个MVP",
                            "commentsNum":1758,
                            "nice":14,
                            "isTop":true,
                            "time":"5小时前",
                            "source":"NBA官网",
                            "sourceLink":"https:www.baidu.com",
                            "content":"虎扑4月13日讯 今日湖人官方宣布，球队与主帅卢克-沃顿分道扬镳。沃顿说道：“我想要感谢珍妮-巴斯和巴斯家族给予我执教湖人的机会。这支球队和这座城市对于我和我家人而言总是很特别。”总经理罗勃-佩林卡说道：“我们想感谢卢克在过去三年来的热忱付出，我们祝福卢克和他的家人未来好运。”沃顿共在湖人执教三个赛季，取得98胜148负的战绩。本赛季湖人以37胜45负的战绩排名西部第十。",
                            "tags":["火箭","戈登"]
                        }
     *              
     *          },
                msg: '成功', 
                statusCode: 200,
     *      }
     */

                